In [2]:
import pandas as pd

### Connect Pandas to the database with this URL:

In [54]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [8]:
titles.title.value_counts().head(5)

Hamlet          18
Carmen          16
Macbeth         15
Maya            12
The Outsider    12
Name: title, dtype: int64

### Which three years of the 1930s saw the most films released?

In [13]:
mo1930s=titles[(titles.year> 1929) & (titles.year < 1940) ]
mo1930s.year.value_counts()

1937    1196
1936    1138
1938    1129
1939    1078
1935    1054
1934     966
1932     936
1933     894
1931     886
1930     820
Name: year, dtype: int64

### Count the number of films that have been released each decade over the history of cinema.

In [28]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [46]:
titles.set_index('year',inplace=True)

In [55]:
titles.groupby([(titles.year//10)*10]).count()

      title   year
year
1890      3      3
1900     37     37
1910   6512   6512
1920   8797   8797
1930  10097  10097
1940   8576   8576
1950  12711  12711
1960  17515  17515
1970  18714  18714
1980  20243  20243
1990  22225  22225
2000  38713  38713
2010  67977  67977
2020    210    210

### Count the number of "Hamlet" films made each decade.

In [59]:
ham=titles[titles.title=='Hamlet']
ham.head()

        title  year
6009   Hamlet  1948
45350  Hamlet  1990
46721  Hamlet  1910
92146  Hamlet  1976
94355  Hamlet  1987

In [63]:
ham.title.groupby([(ham.year//10)*10]).count()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: title, dtype: int64

### Count the number of "Rustler" characters in each decade of the history of film.

### Count the number of "Hamlet" characters each decade.

### What are the 11 most common character names in movie history?

In [66]:
# titles.title.value_counts().head(5)
cast.character.value_counts().head(11)

Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: character, dtype: int64

### Who are the 10 people most often credited as "Herself" in film history?

### Who are the 10 people most often credited as "Himself" in film history?

In [74]:
him=cast[cast.character=='Himself']

In [76]:
him.name.value_counts().head(10)

Adolf Hitler          100
Richard Nixon          46
Ronald Reagan          39
John F. Kennedy        34
Winston Churchill      24
Benito Mussolini       23
George W. Bush         23
Ron Jeremy             23
Martin Luther King     21
Bill Clinton           20
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

### Which actors or actresses appeared in the most movies in the year 1985?

### How many roles Mammootty has played in each year of his career.

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [81]:
cast.head()
patro=cast[cast.character.str.contains("Patron in")]

In [83]:
patro.character.value_counts().head(15)

Patron in Frisky Rabbit         16
Patron in the Coffee House       9
Patron in Chinese Restaurant     9
Patron in Billiard Parlor        5
Patron in Bar                    4
Patron in restaurant             4
Patron in cabaret                3
Patron in Club                   3
Patron in Restaurant             3
Patron in Audience               2
Patron in Quiet Bar              2
Patron in Coffee Shop            2
Patron in booth                  2
Theatre Patron in Loge           2
Movie Patron in Trailer          2
Name: character, dtype: int64

### What are the 10 most frequent roles that start with the word "Science"?

In [87]:
scie=cast[cast.character.str.startswith('Science')]

In [90]:
scie.character.value_counts().head(10)

Science Teacher         60
Science Student          9
Science Fair Student     9
Science Fair Judge       6
Science Promo Cadet      5
Science Club Member      5
Science Reporter         5
Science Kid              5
Science                  4
Science Officer          3
Name: character, dtype: int64

### Count number of n-values of the roles that Judi Dench has played over her career.

### Count number of n-values of Cary Grant's roles through his career.

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [95]:
cast[(cast.name=='Sidney Poitier')&(~cast.n.isnull())].count()

title        42
year         42
name         42
type         42
character    42
n            42
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?